{
  "users": [
    {
      "username": "Aa",
      "password": "ss",
      "age": "ss",
      "email": "ss",
      "isAdmin": true,
      "id": 1
    },
    {
      "username": "ss",
      "password": "ss",
      "age": "ss",
      "email": "ss",
      "isAdmin": false,
      "id": 2
    },
    {
      "username": "noizziday",
      "password": "dan1414dan",
      "age": "19",
      "email": "doulbekov",
      "isAdmin": false,
      "id": 3
    },
    {
      "username": "",
      "password": "",
      "age": "",
      "email": "",
      "isAdmin": false,
      "id": 4
    },
    {
      "username": "",
      "password": "",
      "age": "",
      "email": "",
      "isAdmin": false,
      "id": 5
    },
    {
      "username": "",
      "password": "",
      "age": "",
      "email": "",
      "isAdmin": false,
      "id": 6
    }
  ],
  "products": [
    {
      "name": "Naruto UNS 4 ",
      "description": "The latest opus in the acclaimed STORM series is taking you on a colorful and breathtaking ride. Take advantage of the totally revamped battle system and prepare to dive into the most epic fights you’ve ever seen in the NARUTO SHIPPUDEN™: Ultimate Ninja® STORM series!  In NARUTO SHIPPUDEN™: Ultimate Ninja® STORM 4, a broad set of Ninja Skills will be yours to use against the fiercest foes you’ll ever encounter. Massive attacks in the form of secret techniques, energetic evolutions with the “Awakening”, the inimitable shurikens & kunais and a unique playstyle for each ninja!  Prepare for the most awaited STORM game ever created!  Additional hardware required for Remote Play.",
      "price": 70,
      "imageList": "https://cdn.akamai.steamstatic.com/steam/apps/349040/capsule_616x353.jpg?t=1611701005",
      "imageDetails": "https://i.playground.ru/e/AH5FBDzblsznP3rE_tAscg.jpeg?600-600",
      "type": "Fighting",
      "id": 2
    },
    {
      "name": "BATORA: LOST HAVEN",
      "description": "Batora: Lost Haven — это межпланетный приключенческий ролевой экшен с увлекательным сюжетом, исход которого зависит от принимаемых вами решений.  Аврил никогда не думала, что ей придется стать настоящей героиней, но после одного загадочного разрушительного события ее мир перевернулся. Когда ее планета оказалась на грани уничтожения, у Аврил появились необычные способности, и теперь ей предстоит отправиться в путешествие по вселенной, чтобы раскрыть древние тайны и принять ряд судьбоносных решений.  В Batora: Lost Haven вы сможете изучить несколько уникальных планет и увидите галактику, в которой грань между добром и злом сильно размыта. Вам предстоит изучить уникальные способности Аврил, овладеть несколькими стилями ведения боя, одержать победу над смертоносными врагами, а также решать головоломки и выполнять задания любопытных обитателей других планет. От принимаемых вами решений будет зависеть не только ваше путешествие, но и то, как вы выполните свою главную миссию — восстановите свой потерянный дом.",
      "price": 15,
      "imageList": "https://steampay.com/image/batora-lost-haven.jpg?1666269331",
      "imageDetails": "https://steampay.com/product/batora-lost-haven.jpg?1666269521",
      "type": "RPG",
      "id": 4
    }
  ]
}